Repository: AlphaCoreSolutions/heavy_machine_rent
Catalog: lib/l10n/app_*.arb
Languages: ar

# termManufacturerGuidelines
source: All equipment to be used according to manufacturer guidelines.
ar: يجب استخدام المعدات وفقًا لإرشادات الشركة المصنّعة.

# termCustomerSiteAccess
source: Customer is responsible for site access and safe working environment.
ar: العميل مسؤول عن إتاحة الوصول للموقع وبيئة العمل الآمنة.

# termLiability
source: Damages and liability per company terms and applicable law.
ar: الأضرار والمسؤولية حسب شروط الشركة والقوانين المعمول بها.

# equipmentTermsHeading
source: Equipment Terms:
ar: شروط المعدة:

# noDriverLocations
source: No driver locations found for this request.
ar: لا توجد مواقع سائقين لهذا الطلب.

# requestedNationalityLabel
source: Requested nationality
ar: الجنسية المطلوبة

# coordsLabel
source: Coords
ar: الإحداثيات

# assignedDriverLabel
source: Assigned driver
ar: السائق المعيّن

# companyLogo
source: VISION CIT
ar: شعار الشركة

# detailHash
source: Detail #{id}
ar: تفصيل رقم {id}

# contractSheetTitle
source: Contract Sheet
ar: سجل العقد

# contractChip
source: Contract #{id}
ar: العقد رقم {id}

# requestChip
source: Req #{id}
ar: الطلب رقم {id}

# qtyChip
source: Qty: {qty}
ar: الكمية: {qty}

source: Role: Vendor
ar: الدور: المورّد

source: Role: Customer
ar: الدور: العميل

# rowNothingToSave
source: Nothing to save for this row.
ar: لا يوجد ما يتم حفظه في هذا الصف.

# rowLabel
source: u{unit} {date}
ar: و{unit} {date}

# rowSaved
source: Saved ({label}).
ar: تم الحفظ ({label}).

# rowSaveFailed
source: Save failed ({label}).
ar: فشل الحفظ ({label}).

# endpoint405Noop
source: Update endpoint not enabled (405). Nothing changed on the server.
ar: واجهة التحديث غير مفعلة (405). لم يتم أي تغيير على الخادم.

# savedChip
source: Saved
ar: تم الحفظ

# unsavedChip
source: Unsaved
ar: غير محفوظ

# plannedLabel
source: Planned
ar: المخطط

# actualLabel
source: Actual
ar: الفعلي

# overtimeLabel
source: Overtime
ar: الإضافي

# customerNoteLabel
source: Customer note
ar: ملاحظة العميل

# vendorNoteLabel
source: Vendor note
ar: ملاحظة المورّد

# savingEllipsis
source: Saving…
ar: جارٍ الحفظ…

# infoCreateActivateOrg
source: Please create/activate your Organization first.
ar: يرجى إنشاء/تفعيل مؤسستك أولاً.

source: No contracts yet.
ar: لا توجد عقود حتى الآن.

# notificationsTitle
source: Notifications
ar: الإشعارات

source: No notifications yet.
ar: لا توجد إشعارات بعد.

# chatsTitle
source: Chats
ar: المحادثات

source: Search chats
ar: ابحث في المحادثات

source: No chats yet.
ar: لا توجد محادثات بعد.

# chatTitle
source: Chat #{id}
ar: محادثة رقم {id}

# threadActionsSoon
source: Thread actions coming soon
ar: خيارات المحادثة قريباً

# messageHint
source: Message
ar: اكتب رسالة

# actionSend
source: Send
ar: إرسال

# sendingEllipsis
source: Sending…
ar: جارٍ الإرسال…

# timeNow
source: now
ar: الآن

# timeMinutesShort
source: {m}m
ar: {m}د

# timeHoursShort
source: {h}h
ar: {h}س

# timeDaysShort
source: {d}d
ar: {d}ي

# title_equipmentDetails
source: Equipment details
ar: تفاصيل المعدّة

# msg_failedLoadEquipment
source: Failed to load equipment
ar: فشل في تحميل بيانات المعدّة

# label_availability
source: Availability
ar: التوفر

# label_rentFrom
source: Rent Date (From)
ar: تاريخ بدء الإيجار

# label_returnTo
source: Return Date (To)
ar: تاريخ الإرجاع

# pill_days
source: {count, plural, one{{count} day} other{{count} days}}
ar: {count, plural, one{{count} يوم} other{{count} أيام}}

# label_expectedKm
source: Expected distance (km)
ar: المسافة المتوقعة (كم)

# mini_pricePerKm
source: {currency} {price} / km
ar: {currency} {price} / كم

# label_quantity
source: Quantity
ar: الكمية

# label_requestedQty
source: Requested quantity
ar: الكمية المطلوبة

# mini_available
source: Available: {count}
ar: المتوفر: {count}

# label_driverLocations
source: Driver Locations
ar: مواقع السائقين

# msg_loadingNats
source: Loading available driver nationalities…
ar: جاري تحميل الجنسيات المتاحة للسائقين…

# msg_noNats
source: No driver nationalities available for this equipment.
ar: لا توجد جنسيات سائقين متاحة لهذه المعدّة.

# label_driverNationality
source: Driver nationality *
ar: جنسية السائق *

# label_dropoffAddress
source: Drop-off address
ar: عنوان التسليم

# label_dropoffLat
source: Drop-off latitude *
ar: إحداثي خط العرض *

# label_dropoffLon
source: Drop-off longitude *
ar: إحداثي خط الطول *

# label_notes
source: Notes
ar: ملاحظات

# chip_available
source: Available: {count}
ar: المتوفر: {count}

# label_priceBreakdown
source: Price breakdown
ar: تفاصيل التسعير

# row_perUnit
source: Per unit
ar: لكل وحدة

# row_base
source: Base ({price} × {days} day)
ar: الأساس ({price} × {days} يوم)

# row_distance
source: Distance ({pricePerKm} × {km} km)
ar: المسافة ({pricePerKm} × {km} كم)

# row_vat
source: VAT {rate}%
ar: ضريبة القيمة المضافة {rate}٪

# row_perUnitTotal
source: Per-unit total
ar: إجمالي لكل وحدة

# row_qtyTimes
source: × Quantity ({qty})
ar: × الكمية ({qty})

# row_subtotal
source: Subtotal
ar: الإجمالي الفرعي

# row_vatOnly
source: VAT
ar: الضريبة

# row_total
source: Total
ar: الإجمالي

# row_downPayment
source: Down payment
ar: الدفعة المقدمة

# btn_submit
source: Submit request
ar: إرسال الطلب

# btn_submitting
source: Submitting…
ar: جاري الإرسال…

# row_fuel
source: Fuel: {value}
ar: الوقود: {value}

# err_chooseDates
source: Please choose dates
ar: يرجى اختيار التواريخ

# info_signInFirst
source: Please sign in first
ar: يرجى تسجيل الدخول أولاً

# err_qtyMin
source: Quantity must be at least 1
ar: يجب أن تكون الكمية 1 على الأقل

# err_qtyAvail
source: Only {count} piece(s) available
ar: متاح فقط {count} قطعة

# err_unitSelectNat
source: Unit {index}: Select a nationality
ar: الوحدة {index}: اختر الجنسية

# err_unitLatLng
source: Unit {index}: Drop-off lat/long required
ar: الوحدة {index}: مطلوب إحداثيات التسليم

# err_vendorMissing
source: Vendor not found for this equipment.
ar: لا يوجد مورد لهذه المعدّة.

# info_createOrg
source: Please create/activate your Organization first.
ar: يرجى إنشاء/تفعيل مؤسستك أولاً.

# err_loadNats
source: Could not load equipment driver nationalities.
ar: تعذر تحميل جنسيات السائقين للمعدة.

# err_loadResp
source: Could not load responsibility names.
ar: تعذر تحميل أسماء المسؤوليات.

# equipDetailsTitle
source: Equipment details
ar: تفاصيل المعدّة

# msgFailedLoadEquipment
source: Failed to load equipment
ar: فشل في تحميل بيانات المعدّة

# labelAvailability
source: Availability
ar: التوفر

# labelRentFrom
source: Rent Date (From)
ar: تاريخ بدء الإيجار

# labelReturnTo
source: Return Date (To)
ar: تاريخ الإرجاع

# pillDays
source: {count, plural, one{{count} day} other{{count} days}}
ar: {count, plural, one{{count} يوم} other{{count} أيام}}

# labelExpectedKm
source: Expected distance (km)
ar: المسافة المتوقعة (كم)

# miniPricePerKm
source: {currency} {price} / km
ar: {currency} {price} / كم

# labelQuantity
source: Quantity
ar: الكمية

# labelRequestedQty
source: Requested quantity
ar: الكمية المطلوبة

# miniAvailable
source: Available: {count}
ar: المتوفر: {count}

# labelDriverLocations
source: Driver Locations
ar: مواقع السائقين

# msgLoadingNats
source: Loading available driver nationalities…
ar: جاري تحميل الجنسيات المتاحة للسائقين…

# msgNoNats
source: No driver nationalities available for this equipment.
ar: لا توجد جنسيات سائقين متاحة لهذه المعدّة.

# labelDriverNationality
source: Driver nationality
ar: جنسية السائق *

# labelDropoffAddress
source: Drop-off address
ar: عنوان التسليم

# labelDropoffLat
source: Drop-off latitude *
ar: إحداثي خط العرض *

# labelDropoffLon
source: Drop-off longitude *
ar: إحداثي خط الطول *

# labelNotes
source: Notes
ar: ملاحظات

# labelPriceBreakdown
source: Price breakdown
ar: تفاصيل التسعير

# rowPerUnit
source: Per unit
ar: لكل وحدة

# rowBase
source: Base ({price} × {days} day)
ar: الأساس ({price} × {days} يوم)

# rowDistance
source: Distance ({pricePerKm} × {km} km)
ar: المسافة ({pricePerKm} × {km} كم)

# rowVat
source: VAT {rate}%
ar: ضريبة القيمة المضافة {rate}٪

# rowPerUnitTotal
source: Per-unit total
ar: إجمالي لكل وحدة

# rowQtyTimes
source: × Quantity ({qty})
ar: × الكمية ({qty})

# rowSubtotal
source: Subtotal
ar: الإجمالي الفرعي

# rowVatOnly
source: VAT
ar: الضريبة

# rowTotal
source: Total
ar: الإجمالي

# rowDownPayment
source: Down payment
ar: الدفعة المقدمة

# btnSubmitting
source: Submitting…
ar: جاري الإرسال…

# btnSubmit
source: Submit request
ar: إرسال الطلب

# rowFuel
source: Fuel: {value}
ar: الوقود: {value}

# errChooseDates
source: Please choose dates
ar: يرجى اختيار التواريخ

# infoSignInFirst
source: Please sign in first
ar: يرجى تسجيل الدخول أولاً

# errQtyMin
source: Quantity must be at least 1
ar: يجب أن تكون الكمية 1 على الأقل

# errQtyAvail
source: Only {count} piece(s) available
ar: متاح فقط {count} قطعة

# errUnitSelectNat
source: Unit {index}: Select a nationality
ar: الوحدة {index}: اختر الجنسية

# errUnitLatLng
source: Unit {index}: Drop-off lat/long required
ar: الوحدة {index}: مطلوب إحداثيات التسليم

# errVendorMissing
source: Vendor not found for this equipment.
ar: لا يوجد مورد لهذه المعدّة.

# infoCreateOrgFirst
source: Please create/activate your Organization first.
ar: يرجى إنشاء/تفعيل مؤسستك أولاً.

# errLoadNatsFailed
source: Could not load equipment driver nationalities.
ar: تعذر تحميل جنسيات السائقين للمعدة.

# errLoadRespFailed
source: Could not load responsibility names.
ar: تعذر تحميل أسماء المسؤوليات.

# errRequestAddFailed
source: Request/add failed
ar: فشل إنشاء/إضافة الطلب

source: Request created
ar: تم إنشاء الطلب

source: Unit {index}
ar: الوحدة {index}

source: No images
ar: لا توجد صور

# mapSearchHint
source: Search a place…
ar: ابحث عن موقع…

# mapNoResults
source: No results
ar: لا توجد نتائج

# mapCancel
source: Cancel
ar: إلغاء

# mapUseThisLocation
source: Use this location
ar: استخدام هذا الموقع

# mapExpandTooltip
source: Expand map
ar: تكبير الخريطة

# mapClear
source: Clear
ar: مسح

# mapLatLabel
source: Lat: {value}
ar: خط العرض: {value}

# mapLngLabel
source: Lng: {value}
ar: خط الطول: {value}

# actionLogin
source: Login
ar: تسجيل الدخول

# actionLogout
source: Logout
ar: تسجيل الخروج

# sameDropoffForAll
source: Same Drop-off Location
ar: استخدام نفس موقع التسليم لكل الوحدات

# errUnitAddress
source: Unit {index}: please enter the drop-off address
ar: الوحدة {index}: يرجى إدخال موقع التسليم

# infoCompleteProfileFirst
source: Please complete your profile first.
ar: يرجى إكمال ملفك الشخصي أولًا.

# leaveEmpty
source: Leave Empty For 0%
ar: اتركها فارغة لتكون 0%

# errSelectEquipmentType
source: Select an equipment type
ar: اختر نوع المعدّة

# errSelectEquipmentFromList
source: Select an equipment from the list
ar: اختر معدّة من القائمة

# errSelectFactory
source: Select a factory
ar: اختر المصنع

# errEnterDescriptionEnOrAr
source: Enter a description (English or Arabic)
ar: أدخل الوصف (بالإنجليزية أو العربية)

# errSelectFuelResponsibility
source: Select fuel responsibility
ar: اختر جهة تحمل الوقود

# errSelectTransferType
source: Select transfer type
ar: اختر نوع النقل

# errSelectTransferResponsibility
source: Select transfer responsibility
ar: اختر جهة تحمل النقل

# errSelectDriverTransport
source: Select driver transport responsibility
ar: اختر مسؤولية تنقل السائق

# errSelectDriverFood
source: Select driver food responsibility
ar: اختر مسؤولية طعام السائق

# errSelectDriverHousing
source: Select driver housing responsibility
ar: اختر مسؤولية سكن السائق

# errPricePerDayGtZero
source: Enter price per day (> 0).
ar: أدخل سعر اليوم (> 0).

# errPricePerHourGtZero
source: Enter price per hour (> 0).
ar: أدخل سعر الساعة (> 0).

# errQuantityGteOne
source: Enter quantity (≥ 1).
ar: أدخل الكمية (≥ 1).

# errPleaseCompleteForm
source: Please complete the form
ar: يرجى إكمال الحقول المطلوبة

# errDescRequiredEnOrAr
source: Required (EN or AR)
ar: مطلوب (إنجليزي أو عربي)

# errRequired
source: Required
ar: مطلوب

source: Failed to load equipment
ar: فشل تحميل المعدّة

# unsavedChangesTitle
source: Unsaved changes
ar: تغييرات غير محفوظة

# unsavedChangesBody
source: You have unsaved changes. Save them before leaving?
ar: لديك تغييرات غير محفوظة. هل تريد حفظها قبل المغادرة؟

# actionDiscard
source: Discard
ar: تجاهل

# pickIssueAndExpire
source: Please pick both Issue and Expire dates.
ar: يرجى اختيار تاريخ الإصدار وتاريخ الانتهاء معًا.

# chooseType
source: Please choose a Type.
ar: يرجى اختيار النوع.

# chooseDocumentFile
source: Please choose a document file.
ar: يرجى اختيار ملف المستند.

# nameEnRequired
source: Name (EN) *
ar: الاسم (إنجليزي) *

# nameArRequired
source: Name (AR) *
ar: الاسم (عربي) *

# typeDomain10Required
source: Type *
ar: النوع *

# issueDateRequired
source: Issue date *
ar: تاريخ الإصدار *

# expireDateRequired
source: Expire date *
ar: تاريخ الانتهاء *

# deleteImageTitle
source: Delete image
ar: حذف الصورة

# deleteImageBody
source: Remove this image from the listing?
ar: هل تريد إزالة هذه الصورة من الإعلان؟

# deleteTermQ
source: Delete term?
ar: حذف الشرط؟

source: Add driver
ar: إضافة سائق

source: Edit driver
ar: تعديل السائق

# nationalityRequired
source: Nationality *
ar: الجنسية *

# deleteDriverQ
source: Delete driver?
ar: حذف السائق؟

source: Add driver file
ar: إضافة ملف للسائق

source: Server file name
ar: اسم الملف على الخادم

# fileTypeIdRequired
source: File type id *
ar: معرّف نوع الملف *

# startDateYmd
source: Start yyyy-MM-dd
ar: البداية yyyy-MM-dd

# endDateYmd
source: End yyyy-MM-dd
ar: النهاية yyyy-MM-dd

# actionAdd
source: Add
ar: إضافة

# addFailedWithMsg
source: Add failed: {msg}
ar: فشل الإضافة: {msg}

# fileDescriptionOptionalAr
source: File description Arabic (optional)
ar: وصف الملف بالعربي (اختياري)

# fileDescriptionOptionalEn
source: File description English (optional)
ar: وصف الملف بالانجليزي (اختياري)

source: Required
ar: إلزامي

# previewPdf
source: PDF preview
ar: معاينة PDF

source: Open
ar: فتح

# pickAFileFirst
source: Please pick and upload a file first
ar: يرجى اختيار ورفع ملف أولاً

# savingDots
source: Saving…
ar: جارٍ الحفظ…

source: Try Again
ar: حاول مرة اخرى

source: all
ar: الجميع
