Repository: AlphaCoreSolutions/heavy_machine_rent
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: HeavyRent
ar: هيفي رِنت

# tooltipLogin
source: Login
ar: تسجيل الدخول

# tooltipLogout
source: Logout
ar: تسجيل الخروج

source: Admin
ar: مسؤول

source: Signed in
ar: تم تسجيل الدخول

source: Signed out
ar: تم تسجيل الخروج

# heroTitle
source: Heavy gear, light work
ar: معدات ثقيلة، عمل أسهل

# heroSubtitle
source: Rent certified machines with drivers, on-demand.
ar: استأجر آلات مع سائقين عند الطلب.

source: Find equipment
ar: ابحث عن معدات

source: Popular equipment
ar: المعدات الشائعة

source: See more
ar: المزيد

source: Could not load equipment
ar: تعذر تحميل المعدات

source: Retry
ar: إعادة المحاولة

source: No equipment yet.
ar: لا توجد معدات بعد.

source: Rent
ar: استئجار

# fromPerDay
source: From {price} / day
ar: ابتداءً من {price} / يوم

# distanceKm
source: {km} km
ar: {km} كم

# langEnglish
source: English
ar: الإنجليزية

# langArabic
source: Arabic
ar: العربية

# appTitle
source: HeavyRent
ar: هيفي رِنت

# actionSignIn
source: Sign in
ar: تسجيل الدخول

# actionSignOut
source: Sign out
ar: تسجيل الخروج

# actionRentNow
source: Rent now
ar: استئجار الآن

# actionApply
source: Apply
ar: تطبيق

# actionFilter
source: Filter
ar: تصفية

# actionClose
source: Close
ar: إغلاق

# actionRetry
source: Retry
ar: إعادة المحاولة

# searchHint
source: Search equipment, brands, cities...
ar: ابحث عن المعدات أو العلامات أو المدن...

source: Phone
ar: الهاتف

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# otp
source: OTP Code
ar: رمز التحقق

source: Send code
ar: إرسال الرمز

# verifyCode
source: Verify
ar: تحقق

source: With driver
ar: مع سائق

# pricePerDay
source: {price} / day
ar: {price} / يوم

# resultsCount
source: {count, plural, =0{No results} =1{1 result} other{{count} results}}
ar: {count, plural, =0{لا توجد نتائج} =1{نتيجة واحدة} other{{count} نتائج}}

# validationRequired
source: {field} is required
ar: {field} مطلوب

# validationEmail
source: Enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح

# msgOtpSent
source: We sent a code to {phone}
ar: تم إرسال الرمز إلى {phone}

# snackSaved
source: Saved
ar: تم الحفظ

# snackError
source: Something went wrong
ar: حدث خطأ ما

# settingsLanguage
source: Language
ar: اللغة

# homeHeadline
source: Heavy gear, light work
ar: معدات ثقيلة، عمل أسهل

# homeSub
source: Rent certified machines on‑demand
ar: استأجر معدات معتمدة عند الطلب

# discoverTitle
source: Discover
ar: اكتشف

source: Filters
ar: عوامل التصفية

# filterBrand
source: Brand
ar: العلامة التجارية

# filterCity
source: City
ar: المدينة

# filterPriceDay
source: Price/Day
ar: السعر/اليوم

# filterHasCerts
source: Has certificates
ar: شهادات سارية

# filterDistance
source: Distance pricing
ar: سعر المسافة

# filterApply
source: Apply Filters
ar: تطبيق التصفية

# filterReset
source: Reset
ar: إعادة ضبط

# emptyTitle
source: No results
ar: لا توجد نتائج

# emptyBody
source: Try adjusting filters or search keywords
ar: جرّب تعديل التصفية أو كلمات البحث

source: App settings
ar: إعدادات التطبيق

source: Select time
ar: اختر الوقت

# settingsTheme
source: Theme
ar: السمة

# themeLight
source: Light
ar: فاتح

# themeDark
source: Dark
ar: داكن

# settingsNotifications
source: Notifications
ar: الإشعارات

source: Test
ar: تجربة

# testNotificationMessage
source: This is a test notification
ar: هذه رسالة إشعار تجريبية

source: Push notifications
ar: إشعارات الدفع

source: In-app banners
ar: تنبيهات داخل التطبيق

source: Email updates
ar: تحديثات البريد الإلكتروني

source: Sound
ar: الصوت

source: Quiet hours
ar: ساعات الهدوء

source: From
ar: من

source: To
ar: إلى

# quietHoursHint
source: During quiet hours, sounds are muted. (Demo—wire to your push provider later.)
ar: خلال ساعات الهدوء يتم كتم الأصوات. (تجريبي — اربطه بمزوّد الإشعارات لاحقًا)

# settingsTitle
source: Settings
ar: الإعدادات

# notAvailableTitle
source: Not available
ar: غير متاح

# signInRequiredTitle
source: Sign in required
ar: يلزم تسجيل الدخول

# restrictedPageMessage
source: This page is only available for accounts with user type #17 or #20.
ar: هذه الصفحة متاحة فقط للحسابات ذات نوع المستخدم ‎#17 أو ‎#20.

# signInPrompt
source: Please sign in to continue.
ar: يرجى تسجيل الدخول للمتابعة.

# accountTitle
source: Account
ar: الحساب

# statusCompleted
source: Completed
ar: مكتمل

# statusIncomplete
source: Incomplete
ar: غير مكتمل

# logoutConfirmTitle
source: Log out?
ar: تسجيل الخروج؟

# logoutConfirmBody
source: You can sign in again anytime.
ar: يمكنك تسجيل الدخول مرة أخرى في أي وقت.

source: Cancel
ar: إلغاء

# completeYourAccountBody
source: Complete your account to unlock Organization and My equipment.
ar: أكمل حسابك للوصول إلى المؤسسة ومعداتي.

# completeAction
source: Complete
ar: إكمال

# accountSection
source: Account
ar: الحساب

# manageSection
source: Manage
ar: إدارة

# activitySection
source: Activity
ar: النشاط

# profileTitle
source: Profile
ar: الملف الشخصي

# profileSubtitle
source: Your personal & company details
ar: بياناتك الشخصية وبيانات الشركة

# appSettingsSubtitle
source: Theme, language, notifications
ar: السمة، اللغة، الإشعارات

# organizationTitle
source: Organization
ar: المؤسسة

# organizationSubtitle
source: Company info & compliance
ar: معلومات الشركة والامتثال

# myEquipmentTitle
source: My equipment
ar: معداتي

# myEquipmentSubtitle
source: View and manage your fleet
ar: عرض وإدارة أسطولك

# requestsTitle
source: Requests
ar: الطلبات

# requestsSubtitle
source: Manage your requests
ar: إدارة طلباتك

# superAdminTitle
source: Super Admin
ar: مشرف النظام

# superAdminSubtitle
source: Open super admin panel (debug)
ar: فتح لوحة مشرف النظام (تصحيح)

# contractsTitle
source: Contracts
ar: العقود

# contractsSubtitle
source: Pending, open, finished, closed
ar: قيد الانتظار، مفتوحة، منتهية، مغلقة

# ordersHistoryTitle
source: Orders (history)
ar: الطلبات (سجل)

# ordersHistorySubtitle
source: Past orders & receipts
ar: الطلبات السابقة والإيصالات

source: Mobile number
ar: رقم الجوال

# codeLabel
source: Code
ar: الرمز

# mobile9DigitsLabel
source: Mobile (9 digits)
ar: الجوال (9 أرقام)

# enterNineDigits
source: Enter 9 digits
ar: أدخل 9 أرقام

source: Resend code
ar: إعادة إرسال الرمز

# devOtpHint
source: DEV OTP: {code}
ar: رمز المطور: {code}

# enterCodeTitle
source: Enter code
ar: أدخل الرمز

# verifyAndContinue
source: Verify & continue
ar: تحقق وتابع

# didntGetItTapResend
source: Didn't get it? Tap "Resend code".
ar: لم يصلك؟ اضغط "إعادة إرسال الرمز".

source: Welcome back
ar: مرحبًا بعودتك

# signInWithMobileBlurb
source: Sign in with your mobile number. Fast, secure, OTP-based login.
ar: سجّل الدخول برقم جوالك. طريقة سريعة وآمنة عبر رمز التحقق.

# neverShareNumber
source: We’ll never share your number.
ar: لن نشارك رقمك مع أي جهة.

source: OTP sent
ar: تم إرسال الرمز

source: Could not start verification
ar: تعذّر بدء عملية التحقق

# enterFourDigitCode
source: Enter the 4-digit code
ar: أدخل رمزًا مكوّنًا من 4 أرقام

source: Invalid or expired code
ar: رمز غير صحيح أو منتهي الصلاحية

source: Full name
ar: الاسم الكامل

# passwordKeep
source: Password
ar: كلمة المرور

# validationMinChars
source: Minimum {min} characters
ar: الحد الأدنى {min} أحرف

# actionSaveChanges
source: Save changes
ar: حفظ التغييرات

# actionReset
source: Reset
ar: إعادة التعيين

# profileCompletePrompt
source: Complete your profile
ar: أكمل ملفك الشخصي

source: Failed to load profile
ar: فشل تحميل الملف الشخصي

source: Could not save profile
ar: تعذّر حفظ الملف الشخصي

source: Profile saved
ar: تم حفظ الملف الشخصي

# orgTitle
source: Organization
ar: المنشأة

# orgCreateTitle
source: Create organization
ar: إنشاء منشأة

# orgType
source: Type
ar: النوع

# orgStatus
source: Status
ar: الحالة

# orgNameArabic
source: Name (Arabic)
ar: الاسم (العربية)

# orgNameEnglish
source: Name (English)
ar: الاسم (الإنجليزية)

# orgBriefArabic
source: Brief (Arabic)
ar: نبذة (العربية)

# orgBriefEnglish
source: Brief (English)
ar: نبذة (الإنجليزية)

# orgCountry
source: Country
ar: الدولة

# orgCity
source: City
ar: المدينة

# orgAddress
source: Address
ar: العنوان

# orgCrNumber
source: C.R. Number
ar: رقم السجل التجاري

# orgVatNumber
source: VAT Number
ar: الرقم الضريبي

# orgMainMobile
source: Main mobile
ar: الجوال الأساسي

# orgSecondMobile
source: Second mobile
ar: الجوال الثاني

# orgMainEmail
source: Main email
ar: البريد الإلكتروني الأساسي

# orgSecondEmail
source: Second email
ar: البريد الإلكتروني الثاني

# actionCreate
source: Create
ar: إنشاء

# actionSave
source: Save
ar: حفظ

source: edit
ar: تعديل

# orgFilesTitle
source: Files • Attachments
ar: الملفات • المرفقات

# orgAddFile
source: Add file
ar: إضافة ملف

# orgCreateToManageFiles
source: Create organization to manage files.
ar: أنشئ منشأة لإدارة الملفات.

# orgNoFilesYet
source: No files yet.
ar: لا توجد ملفات بعد.

# attachmentTitle
source: Attachment
ar: مرفق

source: File type
ar: نوع الملف

# addFileNameRequired
source: Add file name *
ar: أدخل اسم الملف *

source: Pick file *
ar: اختيار ملف *

source: Description (optional)
ar: وصف (اختياري)

source: Issue date
ar: تاريخ الإصدار

source: Expire date
ar: تاريخ الانتهاء

source: Image
ar: صورة

source: Active
ar: نشط

source: Expired
ar: منتهي

# orgEnterNameMin3
source: Please enter a name (≥ 3 chars)
ar: يرجى إدخال اسم (3 أحرف فأكثر)

# orgChooseTypeStatusCity
source: Please choose Status, Type and City
ar: يرجى اختيار الحالة والنوع والمدينة

source: Create failed
ar: فشل الإنشاء

source: Update failed
ar: فشل التحديث

# orgCreated
source: Organization created
ar: تم إنشاء المنشأة

# orgUpdated
source: Organization updated
ar: تم تحديث المنشأة

# orgCouldNotSave
source: Could not save organization
ar: تعذّر حفظ المنشأة

source: Failed to load organization
ar: فشل تحميل بيانات المنشأة

# orgCreateFirst
source: Create organization first
ar: أنشئ منشأة أولاً

# chooseFileType
source: Choose a file type
ar: اختر نوع الملف

# pickFileNameRequired
source: Pick a file — name is required
ar: اختر ملفًا — الاسم مطلوب

source: File added
ar: تمت إضافة الملف

source: File updated
ar: تم تحديث الملف

source: Could not save file
ar: تعذّر حفظ الملف

# deleteFileTitle
source: Delete file
ar: حذف الملف

# deleteFileBody
source: Are you sure you want to delete this file?
ar: هل أنت متأكد من حذف هذا الملف؟

source: Delete
ar: حذف

# deleteMissingId
source: Could not delete: missing file id
ar: تعذّر الحذف: رقم الملف مفقود

source: File deleted
ar: تم حذف الملف

source: Could not delete file
ar: تعذّر حذف الملف

# myEquipSignInBody
source: You need to sign in to manage your equipment.
ar: يلزم تسجيل الدخول لإدارة معداتك.

# orgNeededTitle
source: Organization needed
ar: مطلوب منشأة

# orgNeededBody
source: Add your organization before listing or managing equipment.
ar: أضف منشأتك قبل إدراج أو إدارة المعدات.

# actionAddOrganization
source: Add organization
ar: إضافة منشأة

# submittedMayTakeMoment
source: Submitted. It may take a moment to appear.
ar: تم الإرسال. قد يستغرق ظهوره لحظات.

source: Can’t add equipment
ar: لا يمكن إضافة المعدة

# actionOk
source: OK
ar: حسناً

# unexpectedErrorWithMsg
source: Unexpected error: {msg}
ar: خطأ غير متوقع: {msg}

# actionAddEquipment
source: Add equipment
ar: إضافة معدة

# failedToLoadYourEquipment
source: Failed to load your equipment. {error}
ar: تعذّر تحميل معداتك. {error}

# noEquipmentYetTapAdd
source: No equipment yet. Tap “Add equipment” to create one.
ar: لا توجد معدات بعد. اضغط «إضافة معدة» للبدء.

source: Open as customer to rent
ar: افتح كتاجر/عميل للاستئجار

source: Sign In Required
ar: يجب عليك تسجيل الدخول اولا

# equipSettingsTitle
source: Equipment settings
ar: إعدادات المعدة

# tabOverview
source: Overview
ar: نظرة عامة

# tabImages
source: Images
ar: الصور

# tabTerms
source: Terms
ar: الشروط

# tabDrivers
source: Drivers
ar: السائقون

# tabCertificates
source: Certificates
ar: الشهادات

source: Basic info
ar: معلومات أساسية

source: Name (EN)
ar: الاسم (إنجليزي)

source: Name (AR)
ar: الاسم (عربي)

# exampleExcavator
source: e.g. Excavator 22T
ar: مثال: Excavator 22T

# exampleExcavatorAr
source: e.g. حفار ٢٢ طن
ar: مثال: حفّار ٢٢ طن

source: Pricing
ar: التسعير

# pricePerHour
source: Price / hour
ar: السعر / ساعة

# downPaymentPct
source: Down payment: {pct}% → {amount}
ar: الدفعة الأولى: {pct}% → {amount}

# quantityAndStatus
source: Quantity & Status
ar: الكمية والحالة

source: Quantity
ar: الكمية

source: Equipment weight
ar: وزن المعدة

source: Active (visible)
ar: نشط (ظاهر)

source: Inactive (hidden)
ar: غير نشط (مخفي)

source: Save changes
ar: حفظ التغييرات

# noteSendsFullObject
source: Note: saving sends a full object (IDs only for domains) to PUT /Equipment/update.
ar: ملاحظة: الحفظ يرسل كائناً كاملاً (معرّفات فقط) إلى PUT /Equipment/update.

source: Saved
ar: تم الحفظ

# saveFailedWithMsg
source: Save failed: {msg}
ar: فشل الحفظ: {msg}

source: Uploading…
ar: جاري الرفع…

# actionAddImage
source: Add image
ar: إضافة صورة

# actionRefresh
source: Refresh
ar: تحديث

source: No images yet.
ar: لا توجد صور بعد.

source: Image uploaded
ar: تم رفع الصورة

# uploadFailedWithMsg
source: Upload failed: {msg}
ar: فشل الرفع: {msg}

source: Image deleted
ar: تم حذف الصورة

# deleteFailedWithMsg
source: Delete failed: {msg}
ar: فشل الحذف: {msg}

# actionDelete
source: Delete
ar: حذف

# actionEdit
source: Edit
ar: تعديل

# actionAddTerm
source: Add term
ar: إضافة شرط

# actionSaveOrder
source: Save order
ar: حفظ الترتيب

# noTermsYetCreateFirst
source: No terms yet. Click “Add term” to create your first item.
ar: لا توجد شروط بعد. اضغط «إضافة شرط» لإنشاء أول عنصر.

source: Add term
ar: إضافة شرط

source: Edit term
ar: تعديل شرط

source: English
ar: إنجليزي

source: Arabic
ar: عربي

source: Order
ar: الترتيب

# actionCancel
source: Cancel
ar: إلغاء

source: Deleted
ar: تم الحذف

source: Order saved
ar: تم حفظ الترتيب

# orderSaveFailedWithMsg
source: Order save failed: {msg}
ar: فشل حفظ الترتيب: {msg}

source: Driver
ar: سائق

# nationalityIdLabel
source: Nationality id:
ar: معرّف الجنسية:

# actionAddDriver
source: Add driver
ar: إضافة سائق

source: No drivers yet.
ar: لا يوجد سائقون بعد.

source: No files
ar: لا توجد ملفات

# fromDate
source: From
ar: من

# toDate
source: To
ar: إلى

# actionAddFile
source: Add file
ar: إضافة ملف

# deleteFileQ
source: Delete file?
ar: حذف الملف؟

# allFieldsRequired
source: All fields are required
ar: جميع الحقول مطلوبة

# fileAndTypeRequired
source: File and Type ID are required
ar: الملف ونوعه مطلوبان

# actionAddCertificate
source: Add certificate
ar: إضافة شهادة

source: No certificates yet.
ar: لا توجد شهادات بعد.

source: Add certificate
ar: إضافة شهادة

source: Edit certificate
ar: تعديل شهادة

source: Choose file
ar: اختيار ملف

source: PDF selected
ar: تم اختيار PDF

# nameEnReq
source: Name (EN) *
ar: الاسم (إنجليزي) *

# nameArReq
source: Name (AR) *
ar: الاسم (عربي) *

# typeDomain10Req
source: Type*
ar: النوع*

# issueDateReq
source: Issue date *
ar: تاريخ الإصدار *

# expireDateReq
source: Expire date *
ar: تاريخ الانتهاء *

source: Is image
ar: صورة؟

source: Saving…
ar: جاري الحفظ…

# pleasePickIssueAndExpire
source: Please pick both Issue and Expire dates.
ar: يرجى اختيار تاريخ الإصدار والانتهاء.

# pleaseChooseType
source: Please choose a Type.
ar: يرجى اختيار النوع.

# pleaseChooseDocument
source: Please choose a document file.
ar: يرجى اختيار ملف الوثيقة.

# deleteCertificateQ
source: Delete certificate?
ar: حذف الشهادة؟

source: No past orders yet
ar: لا توجد طلبات سابقة بعد

source: Failed to load orders
ar: فشل في تحميل الطلبات

# myRequestsTitle
source: My requests
ar: طلباتي

# signInToViewRequests
source: Sign in to view your requests
ar: سجّل الدخول لعرض طلباتك

# signInToViewRequestsBody
source: You need to be logged in to see your request history and details.
ar: يجب تسجيل الدخول لعرض سجل طلباتك وتفاصيلها.

source: Failed to load requests
ar: فشل في تحميل الطلبات

source: No requests yet.
ar: لا توجد طلبات بعد.

# requestNumber
source: Request #
ar: طلب رقم #

source: As Vendor
ar: بصفة مزوّد

source: As Customer
ar: بصفة عميل

# daysSuffix
source: days
ar: يوم / أيام

# requestDetailsTitle
source: Request details
ar: تفاصيل الطلب

source: Failed to load request
ar: فشل في تحميل الطلب

# sectionDuration
source: Duration
ar: المدة

# sectionPriceBreakdown
source: Price breakdown
ar: تفصيل الأسعار

# priceBase
source: Base
ar: الأساسي

# priceDistance
source: Distance
ar: المسافة

# priceVat
source: VAT
ar: ضريبة القيمة المضافة

# priceTotal
source: Total
ar: الإجمالي

# priceDownPayment
source: Down payment
ar: الدفعة المقدمة

# sectionAssignDrivers
source: Assign drivers
ar: تعيين السائقين

# errorLoadDriverLocations
source: Could not load driver locations.
ar: تعذر تحميل مواقع السائقين.

# emptyNoDriverLocations
source: No driver locations for this request.
ar: لا توجد مواقع سائقين لهذا الطلب.

# errorNoDriversForNationality
source: Some units have no available drivers for the requested nationality.
ar: بعض الوحدات لا تحتوي على سائقين متاحين للجنسية المطلوبة.

# errorAssignDriverEachUnit
source: Select a driver for every unit.
ar: يرجى اختيار سائق لكل وحدة.

# actionCreateContract
source: Create contract
ar: إنشاء عقد

# creatingEllipsis
source: Creating…
ar: جارٍ الإنشاء…

# actionCancelRequest
source: Cancel request
ar: إلغاء الطلب

# unitLabel
source: Unit
ar: وحدة

source: Requested nationality
ar: الجنسية المطلوبة

# dropoffLabel
source: Drop-off
ar: مكان التسليم

# coordinatesLabel
source: Coords
ar: الإحداثيات

# emptyNoDriversForThisNationality
source: No drivers available for this nationality.
ar: لا يوجد سائقون متاحون لهذه الجنسية.

# labelAssignDriverFiltered
source: Assign driver (filtered by nationality)
ar: تعيين سائق (حسب الجنسية)

# hintSelectDriver
source: Select driver
ar: اختر سائقًا

# orderNumber
source: Order #
ar: طلب رقم

# requestListLeadingLabel
source: Request #
ar: طلب رقم

# currencySar
source: SAR
ar: ر.س

source: Pending
ar: قيد الإصدار

# daySingular
source: day
ar: يوم

# toDateSep
source: to
ar: إلى

source: Details copied
ar: تم نسخ التفاصيل

# requestSubmittedTitle
source: Request submitted
ar: تم إرسال الطلب

# successTitle
source: Success!
ar: تم بنجاح!

# numberPendingChip
source: Number pending
ar: الرقم قيد الإصدار

# requestSubmittedBody
source: Your request has been submitted.
ar: تم إرسال طلبك بنجاح.

# requestLabel
source: Request:
ar: الطلب:

# requestHashPrefix
source: Request #
ar: رقم الطلب

# statusLabel
source: Status
ar: الحالة

# dateRangeLabel
source: Date range
ar: نطاق التاريخ

# totalLabel
source: Total
ar: الإجمالي

# actionCopyDetails
source: Copy details
ar: نسخ التفاصيل

# actionDone
source: Done
ar: تم

# daysCount
source: {count, plural, one {# day} other {# days}}
ar: {count, plural, zero {# يوم} one {# يوم} two {# يومان} few {# أيام} many {# يومًا} other {# يوم}}

# equipmentTitle
source: Equipment
ar: المعدات

# searchByDescriptionHint
source: Search by description…
ar: ابحث حسب الوصف…

source: Failed to load equipment list
ar: فشل تحميل قائمة المعدات

source: No results
ar: لا توجد نتائج

# equipEditorTitleNew
source: New equipment
ar: معدات جديدة

# actionContinue
source: Continue
ar: متابعة

# errorCouldNotLoadFactories
source: Could not load factories
ar: تعذّر تحميل المصانع

# errorChooseEquipmentType
source: Choose an equipment type
ar: اختر نوع المعدّة

# errorChooseFactory
source: Choose a factory
ar: اختر المصنع

# errorEnterDescription
source: Enter a description (EN or AR)
ar: أدخل الوصف (إنجليزي أو عربي)

# errorFailedToLoadOptions
source: Failed to load options
ar: فشل تحميل الخيارات

# sectionType
source: Type
ar: النوع

# labelEquipmentList
source: Equipment list
ar: قائمة المعدات

# selectedPrefix
source: Selected:
ar: المحدد:

# sectionOwnershipStatus
source: Ownership & Status
ar: الملكية والحالة

# labelFactory
source: Factory
ar: المصنع

# hintSelectFactory
source: Select a factory
ar: اختر مصنعاً

# tooltipRefreshFactories
source: Refresh factories
ar: تحديث المصانع

# labelStatusD11
source: Status
ar: الحالة

# sectionLogistics
source: Logistics
ar: الخدمات اللوجستية

# labelCategoryD9
source: Category
ar: الفئة

# labelFuelRespD7
source: Fuel responsibility
ar: مسؤولية الوقود

# labelTransferTypeD8
source: Transfer type
ar: نوع النقل

# labelTransferRespD7
source: Transfer responsibility
ar: مسؤولية النقل

# sectionDriverRespD7
source: Driver responsibilities
ar: مسؤوليات السائق

# labelTransport
source: Transport
ar: النقل

# labelFood
source: Food
ar: الطعام

# labelHousing
source: Housing
ar: السكن

# sectionDescriptions
source: Descriptions
ar: الأوصاف

# labelDescEnglish
source: Description (English)
ar: الوصف (بالإنجليزية)

# hintDescEnglish
source: e.g. Excavator 22T
ar: مثال: حفّار 22 طن

# labelDescArabic
source: Description (Arabic)
ar: الوصف (بالعربية)

# hintDescArabic
source: e.g. 22T Excavator (Arabic)
ar: مثال: حفّار ٢٢ طن

# sectionPricing
source: Pricing
ar: التسعير

# labelPricePerDay
source: Price per day
ar: السعر لليوم

# hintPricePerDay
source: e.g. 1600
ar: مثال: 1600

# labelPricePerHour
source: Price per hour
ar: السعر للساعة

# hintPricePerHour
source: e.g. 160
ar: مثال: 160

# ruleHoursPerDayAndDp
source: Rule: 1 day = {hours} hours. Down payment = {percent}%.
ar: قاعدة: 1 يوم = {hours} ساعة. الدفعة المقدمة = ‎{percent}%‎.

# downPaymentAuto
source: Down payment (auto): {amount}
ar: الدفعة المقدمة (آلياً): {amount}

# sectionQuantity
source: Quantity
ar: الكمية

# labelQuantityAlsoAvailable
source: Quantity (also used as Available)
ar: الكمية (وتُستخدم كالمتوفر)

# hintQuantity
source: e.g. 1
ar: مثال: 1

# noteAvailableReserved
source: Available = Quantity, Reserved starts at 0 (both updated later).
ar: المتوفر = الكمية، والمحجوز يبدأ من 0 (ويتم تحديثهما لاحقاً).

source: Unnamed factory
ar: مصنع بدون اسم

# contractTitle
source: Contract
ar: العقد

# actionOpenContractSheet
source: Open Contract Sheet
ar: فتح سجل العقد

# actionPrint
source: Print
ar: طباعة

# printingStubMessage
source: Printing stub — wire up printing/pdf here.
ar: تنبيه الطباعة — يرجى ربط الطباعة/‏PDF هنا.

# errorFailedToLoadContractDetails
source: Failed to load contract details
ar: فشل تحميل تفاصيل العقد

# errorNoContractSlice
source: No contract slice found/created.
ar: لم يتم العثور على مقطع للعقد / لم يُنشأ.

# rentalAgreementHeader
source: RENTAL AGREEMENT
ar: اتفاقية تأجير

# contractNumber
source: Contract #{num}
ar: العقد رقم {num}

# sectionParties
source: Parties
ar: الأطراف

# sectionRequestSummary
source: Request Summary
ar: ملخص الطلب

# sectionEquipment
source: Equipment
ar: المعدة

# sectionResponsibilities
source: Responsibilities
ar: المسؤوليات (النطاق 7)

# sectionTerms
source: Terms & Conditions
ar: الشروط

# sectionDriverAssignments
source: Driver Assignments (per requested unit)
ar: تعيينات السائقين (لكل وحدة مطلوبة)

# sectionSignatures
source: Signatures
ar: التواقيع

# vendorLabel
source: Vendor
ar: المورّد

# customerLabel
source: Customer
ar: العميل

# requestNumberLabel
source: Request No.
ar: رقم الطلب

# quantityLabel
source: Quantity
ar: الكمية

# daysLabel
source: Days
ar: الأيام

# rentPerDayLabel
source: Rent / Day
ar: الإيجار / اليوم

# subtotalLabel
source: Subtotal
ar: الإجمالي الفرعي

# vatLabel
source: VAT
ar: ضريبة القيمة المضافة

# downPaymentLabel
source: Down Payment
ar: الدفعة المقدمة

# titleLabel
source: Title
ar: العنوان

# categoryLabel
source: Category
ar: الفئة

# fuelResponsibilityLabel
source: Fuel Responsibility
ar: مسؤولية الوقود

# driverFoodLabel
source: Driver Food
ar: طعام السائق

# driverHousingLabel
source: Driver Housing
ar: سكن السائق

# driverTransportLabel
source: Driver Transport
ar: نقل السائق

# responsibilityValue
source: {label} (ID #{id})
ar: {label}

# termDownPayment
source: Down payment before mobilization; remaining as per agreed schedule.
ar: الدفعة المقدمة قبل التحريك؛ والباقي حسب الجدول المتفق عليه.
